In [3]:
import ibis

from settings import conf

In [7]:
con = ibis.omniscidb.connect(**conf['omniscidb'])
con.list_tables()

['diamonds', 'batting', 'awards_players', 'functional_alltypes', 'geo']

In [8]:
expr = con.table('functional_alltypes').head()
con.create_table(table_name='my_new_table_temp', obj=expr, is_temporary=True)

In [9]:
con.list_tables()

['diamonds',
 'batting',
 'awards_players',
 'functional_alltypes',
 'geo',
 'my_new_table_temp']

In [10]:
con.table('my_new_table_temp').execute()

,index,Unnamed__0,id,bool_col,tinyint_col,smallint_col,int_col,bigint_col,float_col,double_col,date_string_col,string_col,timestamp_col,year_,month_
0,0,0,6690,True,0,0,0,0,0.0,0.0,11/01/10,0,2010-11-01 00:00:00,2010,11
1,1,1,6691,False,1,1,1,10,1.1,10.1,11/01/10,1,2010-11-01 00:01:00,2010,11
2,2,2,6692,True,2,2,2,20,2.2,20.2,11/01/10,2,2010-11-01 00:02:00,2010,11
3,3,3,6693,False,3,3,3,30,3.3,30.3,11/01/10,3,2010-11-01 00:03:00,2010,11
4,4,4,6694,True,4,4,4,40,4.4,40.4,11/01/10,4,2010-11-01 00:04:00,2010,11